ДипломДубль/src/InformationRegisters/ВКМ_ЛогированиеЧатБотаТелеграм/ВКМ_ЛогированиеЧатБотаТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ЛогированиеЧатБотаТелеграм</name>
  <attributes>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификтор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДипломДубль/src/CommonModules/ВКМ_УправлениеТелеграммБотом/Module.bsl
#Область ПрограммныйИнтерфейс
 
// Функция СоздатьHTTPСоединение(ПараметрыПодключения) 
	
//	Результат = Новый HTTPСоединение(
//		ПараметрыПодключения.Сервер,
//		ПараметрыПодключения.Порт,
//		ПараметрыПодключения.Пользователь,
//		ПараметрыПодключения.Пароль,
//		ПараметрыПодключения.Прокси,
//		ПараметрыПодключения.Таймаут,
//		ПараметрыПодключения.ЗащищенноеСоединение);
	
//	Возврат Результат;
	
//КонецФункции

// Формирование записи в справочник 
// Параметры:
//   Сообщение -Строка- Строка сообщения.
Процедура ЗаписьСообщения(Сообщение) Экспорт 
	
	ТекущееСообщение = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
	ТекущееСообщение.ТекстСообщения = Сообщение;
	ТекущееСообщение.Записать();
	
КонецПроцедуры	
 

// Запись ошибок
// Параметры:
//   КодОтвета -Строка- .
//   ТелоОтвета -Строка- .
Процедура  СформироватьЛогЧатБотаТелеграм(КодОтвета,ТелоОтвета) Экспорт  
	
	Рег=РегистрыСведений.ВКМ_ЛогированиеЧатБотаТелеграм.СоздатьМенеджерЗаписи();
	Рег.Идентификтор=Новый УникальныйИдентификатор;   
	Рег.КодСостояния=КодОтвета;  
	рег.ДатаОперации=ТекущаяДатаСеанса();
	Рег.ТелоЗапроса=Новый ХранилищеЗначения(ТелоОтвета, Новый СжатиеДанных(9));
	Рег.Записать(Истина);
КонецПроцедуры

// Отправление сообщения 
Процедура ОтправитьСообщенияВЧатБотТелеграмСлужебные() Экспорт          
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграммБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграммБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграммБоту КАК ВКМ_УведомленияТелеграммБоту
		|ГДЕ
		|	НЕ ВКМ_УведомленияТелеграммБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОтправитьСообщение(Выборка.ТекстСообщения);
		
		ТекСообщение = Выборка.Ссылка;
		ОбСообщение = ТекСообщение.ПолучитьОбъект();
		ОбСообщение.ПометкаУдаления = Истина;
		
		Попытка
			ОбСообщение.Записать();
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры      

// Отправить сообщение 
// Параметры:
//   Сообщение -Строка- Строка сообщения.
Процедура ОтправитьСообщение(Сообщение) Экспорт
	НастройкаЧатБота=СформироватьПараметрыНастроекЧатБотаТелеграмм();
	Сервер = НастройкаЧатБота.Сервер;//"api.telegram.org";                                               
	Прокси= ПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	
	TokenTelegramm=НастройкаЧатБота.TokenTelegramm;
	
	Соединение = Новый HTTPСоединение(
		НастройкаЧатБота.Сервер,
		НастройкаЧатБота.Порт,
		НастройкаЧатБота.Пользователь,
		НастройкаЧатБота.Пароль,
		НастройкаЧатБота.Прокси,
		НастройкаЧатБота.Таймаут,
		Новый ЗащищенноеСоединениеOpenSSL());

	Ресурс = "bot" + TokenTelegramm + "/"+НастройкаЧатБота.ГруппаTelegramm+"&text= " +Сообщение;     
	Попытка	
		Запрос = Новый HTTPЗапрос(Ресурс);	
		Ответ = Соединение.Получить(Запрос);  
		Если Ответ.КодСостояния=200 тогда                               
			СформироватьЛогЧатБотаТелеграм(Ответ.КодСостояния,Сообщение);
		Иначе
			СформироватьЛогЧатБотаТелеграм(Ответ.КодСостояния,"Отправка данных Ошибка");
		КонецЕсли;
	Исключение 
		СформироватьЛогЧатБотаТелеграм(900,"Ошибка запроса (Интернет соединение отсутствует)");
	КонецПопытки;
КонецПроцедуры	

// Формирование параметров настройки 
// Возвращаемое значение:
// Структура - параметры настройки.
Функция СформироватьПараметрыНастроекЧатБотаТелеграмм() Экспорт    
	
	ПараметрыЧатБота=Новый Структура;
	ПараметрыЧатБота.Вставить("Сервер","api.telegram.org");
	ПараметрыЧатБота.Вставить("Порт",443);
	//ПараметрыЧатБота.Вставить("Пользователь","");
	//ПараметрыЧатБота.Вставить("Пароль","");
	ПараметрыЧатБота.Вставить("Таймаут",5);
	ПараметрыЧатБота.Вставить("TokenTelegramm",Константы.ВКМ_ТокенТелеграмм.Получить());
	ПараметрыЧатБота.Вставить("ГруппаTelegramm",Константы.ВКМ_ИдентификаторГруппы.Получить());
	
    Возврат ПараметрыЧатБота;
	
КонецФункции

# КонецОбласти
//
